init.org


#+TITLE: Emacs initialization

* Early initialization
:PROPERTIES:
:header-args: :tangle early-init.el
:END:

Emacs 27+ loads =early-init.el= before =package.el= is initialized and
before the GUI is drawn. Straight.el replaces =package.el= as the
package manager, so =package.el= is disabled here to prevent it from
loading packages at startup (which otherwise triggers a warning from
straight.el about duplicate package versions).

#+BEGIN_SRC emacs-lisp
  ;;; -*- lexical-binding: t -*-
  (setq package-enable-at-startup nil)
#+END_SRC

* Emacs Initialization
:PROPERTIES:
:header-args: :tangle init.el
:END:

This document describes how Emacs is initialized.
** Run local pre-initialization

Run machine dependant initialization file before running the common
setup. This file (=~/.emacs.d/local-pre-init.el=) should contain configuration
that varies between machines, such as:

- Proxy settings
- AI/LLM backend configuration (Bedrock vs Claude API, Ollama settings)
- Machine-specific environment variables
- Custom paths or hostnames

#+BEGIN_SRC emacs-lisp
  ;;; -*- lexical-binding: t -*-
  (setq local-pre-init-file "~/.emacs.d/local-pre-init.el")
  (if (file-exists-p local-pre-init-file)
  (load local-pre-init-file)
  )
#+END_SRC

*** Example: Proxy Setup

Following snippet can be used to set up proxy. It tries to ping the
host and if it succeeds within one second, it sets up environment
variables. Package managers will use these when cloning repositories.

#+BEGIN_EXAMPLE emacs-lisp
;; In local-pre-init.el:
(if (= 0 (call-process "ping" nil nil nil "-W" "1" "-c" "1" "1.2.3.4"))
    (progn
      (setenv "http_proxy" "http://1.2.3.4:8080")
      (setenv "https_proxy" "http://1.2.3.4:8080")))
#+END_EXAMPLE

*** Example: AI Backend Configuration

See the "AI tool setup" section below for detailed examples of how to
configure different LLM backends (Bedrock, Claude API, Ollama) in
=local-pre-init.el= for work vs personal machines.

** Straight packet manager

#+BEGIN_SRC emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+END_SRC

Install =use-package= via straight and make =:straight t= the implicit
default for every =use-package= form. Without this, a bare
=use-package= falls back to =package.el= (=:straight t=), which loads
=package.el= alongside straight and produces the "package.el was
loaded when straight.el was already loaded" warning.

#+BEGIN_SRC emacs-lisp
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+END_SRC

** Appearance
*** All the icons
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons
  :straight t)
#+END_SRC

*** Nerd icons

Nerd icons are used by doom-themes treemacs theme and doom-modeline.
Fonts are installed automatically on first launch if missing.

#+BEGIN_SRC emacs-lisp
  (use-package nerd-icons
    :straight t
    :config
    (let ((font-dest (concat (or (getenv "XDG_DATA_HOME")
                                 (concat (getenv "HOME") "/.local/share"))
                             "/fonts/"
                             nerd-icons-fonts-subdirectory)))
      (unless (cl-every (lambda (font)
                          (file-exists-p (expand-file-name font font-dest)))
                        nerd-icons-font-names)
        (nerd-icons-install-fonts t))))
#+END_SRC
*** Minimalistic user interface

Emacs shows startup screen. It gets anoying after a while, so they
need to be turned off.

#+BEGIN_SRC emacs-lisp 
  (setq inhibit-startup-message t)
  (setq inhibit-splash-screen t)
#+END_SRC

After getting used to the keyboard interface the menus and such just
takes valuable screen space. So mouse interface is turned off.
This is done early in the initialization to prevent momentary display.

#+BEGIN_SRC emacs-lisp 
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
#+END_SRC

*** Fonts

Editing a lot of text using fixed width font is not optimum situation. After a while of googling 
I found a way to use variable length fonts (see [[https://yoo2080.wordpress.com/2013/05/30/monospace-font-in-tables-and-source-code-blocks-in-org-mode-proportional-font-in-other-parts/][the blog of Jisan Yoo]]).

First we hook variable-pitch-mode
#+BEGIN_SRC emacs-lisp 
  (add-hook 'text-mode-hook 'variable-pitch-mode)
#+END_SRC

The problem is that I don't want code and tables to be variable width inside
Org mode document. This can be archived by altering some faces
used by the Org mode.

#+BEGIN_SRC emacs-lisp :tangle no
  (defun my-adjoin-to-list-or-symbol (element list-or-symbol)
    (let ((list (if (not (listp list-or-symbol))
                    (list list-or-symbol)
                  list-or-symbol)))
      (require 'cl-lib)
      (cl-adjoin element list)))

    (mapc
      (lambda (face)
        (set-face-attribute
         face nil
         :inherit
         (my-adjoin-to-list-or-symbol
          'fixed-pitch
          (face-attribute face :inherit))))
      (list 'org-code 'org-block 'org-table 'org-meta-line))
#+END_SRC

*** Doom Themes

#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
    :straight t
    :straight t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-acario-dark t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (nerd-icons must be installed!)
    (doom-themes-neotree-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))  
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package doom-modeline
  :straight t
  :straight t
  :init (doom-modeline-mode 1))
  
 #+END_SRC


  Of course we can choose what kind of faces ~variable-pitch~ and ~fixed-pitch~ are.
 #+BEGIN_SRC emacs-lisp :tangle no
  (set-face-attribute 'variable-pitch nil :height 1.3 :family "FiraCode Nerd Font")
    (set-face-attribute 'variable-pitch nil :height 1.3 :family "Calibri")
    (set-face-attribute 'fixed-pitch nil :height 0.8 :family "DejaVu Sans Mono")
#+END_SRC

While we are at it we could make Org-mode look a little better in general.
#+BEGIN_SRC emacs-lisp :tangle no
(require 'org-bullets)
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-hide-leading-stars t)
(setq line-spacing 0.25)
(set-face-attribute 'org-tag nil :weight 'normal :height 0.8)
(set-face-attribute 'org-todo nil :weight 'normal :height 150)
(set-face-attribute 'org-priority nil :weight 'normal :height 100)
(set-face-attribute 'org-todo nil :weight 'normal :height 100)
(set-face-attribute 'org-done nil :weight 'normal :height 100)
(set-face-attribute 'org-special-keyword nil :height 90)
(set-face-attribute 'org-level-1 nil :height 1.3)
(set-face-attribute 'org-level-2 nil :height 1.2)
(set-face-attribute 'org-level-3 nil :height 1.1)
#+END_SRC

*** Gaps between windows

Small gaps between windows make it easier to see where one window
ends and the next begins.

#+BEGIN_SRC emacs-lisp
  (setq window-divider-default-right-width 4
        window-divider-default-bottom-width 4)
  (set-face-foreground 'window-divider "#2E3044")
  (window-divider-mode 1)
#+END_SRC

*** Minibuffer to center of the screen

With wide screen it is a bit complicated to see lower left of the screen. This moves minibuffer to center.

#+BEGIN_SRC emacs-lisp
    (use-package vertico-posframe
      :straight t
      :after vertico
      :init
      (vertico-posframe-mode 1)
      (setq vertico-posframe-poshandler 'posframe-poshandler-frame-top-center)
      )
  #+END_SRC

** Treemacs

The highlight line face is brightened so it is visible against the
dark background of doom-acario-dark.

#+BEGIN_SRC emacs-lisp
  (use-package treemacs
    :straight t
    :bind
    ("C-x t t" . treemacs-select-window)
    :config
    (setq treemacs-width 30)
    (set-face-attribute 'treemacs-hl-line-face nil
                        :background "#2a2a3e"
                        :extend t))
#+END_SRC

Nerd-icons theme for treemacs replaces the doom-themes treemacs
integration which depends on all-the-icons fonts.

#+BEGIN_SRC emacs-lisp
  (use-package treemacs-nerd-icons
    :straight t
    :after treemacs
    :config
    (treemacs-load-theme "nerd-icons"))
  #+END_SRC
** Docker

#+BEGIN_SRC emacs-lisp
(use-package docker
  :straight t
  :straight t
  :bind ("C-c d" . docker))
  #+END_SRC
  
** Exec path

At least in MacOS there is problems of ~exec-path~ being insufficient.
The main hedeach this causes is that gpg is not found and encrypted
files can not be opened or saved.

Following code will extract exec-path from ~PATH~ variable.

#+BEGIN_SRC emacs-lisp 
(let ((elements (split-string (getenv "PATH") ":")))
  (dolist (e elements)
    (add-to-list 'exec-path e)))
#+END_SRC

In some cases ~bin~ directory in home directory is missing in the ~exec-path~. Same thing goes to the
~/usr/local/bin~. These are often used in my machines.

#+BEGIN_SRC emacs-lisp 
(add-to-list 'exec-path "~/bin")
(add-to-list 'exec-path "/usr/local/bin")
#+END_SRC

** Lisp files

Additional lisp code is located in own directory. These can be loaded
later using ~require~ function for example.

#+BEGIN_SRC emacs-lisp 
(add-to-list 'load-path "~/.emacs.d/lisp/")
#+END_SRC

** Using GPG-Agent in MacOS

MacOS is a "funny" thing. There is a different environment for shell and
different for applications. This will set the SSH agent socket for Emacs.

#+BEGIN_SRC emacs-lisp 
  (when (eq system-type 'darwin)
  (setenv "SSH_AUTH_SOCK" (concat (getenv "HOME") "/.gnupg/S.gpg-agent.ssh")))
#+END_SRC

** Tabs

Do not indent with tabs by default.

#+BEGIN_SRC emacs-lisp 
(setq-default indent-tabs-mode nil)
#+END_SRC

But if you do use tab its width is two.
#+BEGIN_SRC emacs-lisp 
(setq-default tab-width 2)
#+END_SRC

** No transient mark by default

Following disables [[https://www.emacswiki.org/emacs/TransientMarkMode][transient mark mode]]. This means that text is not selected by
default like in "normal" editors.  This allows more convient text editing while
it requires some practice.

#+BEGIN_SRC emacs-lisp 
(transient-mark-mode 0)
#+END_SRC

** Allow narrowing buffer

After over year of practice I am begin to think that can start to lear some
[[https://www.emacswiki.org/emacs/Narrowing][narrowing]]. It is disabled by default and needs to be enabled.

#+BEGIN_SRC emacs-lisp 
(put 'narrow-to-region 'disabled nil)
#+END_SRC

** Backups

#+BEGIN_SRC emacs-lisp 
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq
  delete-old-versions t
  kept-new-versions 6
  kept-old-versions 2
  version-control t
  backup-by-copying t
)
#+END_SRC

** Browser

#+BEGIN_SRC emacs-lisp 
  (when (eq system-type 'darwin)
     (setq browse-url-browser-function 'browse-url-default-macosx-browser))
#+END_SRC

