init.el
;;; -*- lexical-binding: t -*-
(setq local-pre-init-file "~/.emacs.d/local-pre-init.el")
(if (file-exists-p local-pre-init-file)
(load local-pre-init-file)
)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(use-package all-the-icons
:straight t)

(use-package nerd-icons
  :straight t
  :config
  (let ((font-dest (concat (or (getenv "XDG_DATA_HOME")
                               (concat (getenv "HOME") "/.local/share"))
                           "/fonts/"
                           nerd-icons-fonts-subdirectory)))
    (unless (cl-every (lambda (font)
                        (file-exists-p (expand-file-name font font-dest)))
                      nerd-icons-font-names)
      (nerd-icons-install-fonts t))))

(setq inhibit-startup-message t)
(setq inhibit-splash-screen t)

(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))

(add-hook 'text-mode-hook 'variable-pitch-mode)

(use-package doom-themes
  :straight t
  :straight t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-acario-dark t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (nerd-icons must be installed!)
  (doom-themes-neotree-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package doom-modeline
:straight t
:straight t
:init (doom-modeline-mode 1))

(setq window-divider-default-right-width 4
      window-divider-default-bottom-width 4)
(set-face-foreground 'window-divider "#2E3044")
(window-divider-mode 1)

(use-package vertico-posframe
  :straight t
  :after vertico
  :init
  (vertico-posframe-mode 1)
  (setq vertico-posframe-poshandler 'posframe-poshandler-frame-top-center)
  )

(use-package treemacs
  :straight t
  :bind
  ("C-x t t" . treemacs)
  :config
  (setq treemacs-width 30))

(use-package treemacs-nerd-icons
  :straight t
  :after treemacs
  :config
  (treemacs-load-theme "nerd-icons"))

(use-package docker
  :straight t
  :straight t
  :bind ("C-c d" . docker))

(let ((elements (split-string (getenv "PATH") ":")))
  (dolist (e elements)
    (add-to-list 'exec-path e)))

(add-to-list 'exec-path "~/bin")
(add-to-list 'exec-path "/usr/local/bin")

(add-to-list 'load-path "~/.emacs.d/lisp/")

(when (eq system-type 'darwin)
(setenv "SSH_AUTH_SOCK" (concat (getenv "HOME") "/.gnupg/S.gpg-agent.ssh")))

(setq-default indent-tabs-mode nil)

(setq-default tab-width 2)

(transient-mark-mode 0)

(put 'narrow-to-region 'disabled nil)

(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq
  delete-old-versions t
  kept-new-versions 6
  kept-old-versions 2
  version-control t
  backup-by-copying t
)

(when (eq system-type 'darwin)
   (setq browse-url-browser-function 'browse-url-default-macosx-browser))
