init.org
** Org-mode

https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html

Set up agenda functionality. Files are located under org-directory
under home.

#+BEGIN_SRC emacs-lisp 
(setq org-directory "~/org")
(setq org-agenda-files (concat org-directory "/agenda"))
(setq org-default-notes-file (concat org-directory "/refile.org.gpg"))
#+END_SRC


Set up archive file that is encrypted. By default entries would be archive
to files postfixed by ~_archive~. This file is not encrypted and that could
be a problem.

#+BEGIN_SRC emacs-lisp 
(setq org-archive-location (concat org-directory "/archive.org.gpg::* From %s"))
#+END_SRC


Setup default keys (see [[http://orgmode.org/org.html#Activation][Org mode activation]]). There has not been any
reason to change them yet.
#+BEGIN_SRC emacs-lisp 
  (global-set-key "\C-cl" 'org-store-link)
  (global-set-key "\C-ca" 'org-agenda)
  (global-set-key "\C-cc" 'org-capture)
  (global-set-key "\C-cb" 'org-iswitchb)
#+END_SRC



Active babel languages.
#+BEGIN_SRC emacs-lisp 
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (makefile . t)
   (shell . t)
   (js . t)
   (plantuml . t)
   (emacs-lisp  . t)
   (ditaa . t)
   ))
#+END_SRC

*** State changes and logging 

Following will add GTD type of state for the tasks and provide logging.

#+BEGIN_SRC emacs-lisp 
(setq org-log-into-drawer t)
(setq org-todo-keywords '((sequence  "TODO(t!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELLED(c@)")))
#+END_SRC

Log looks something like this under the task header line.
#+BEGIN_EXAMPLE
:LOGBOOK:
- State "WAIT"       from "DONE"       [2016-02-22 Mon 16:03]
- State "WAIT"       from "TODO"       [2016-02-22 Mon 16:03]
:END:
#+END_EXAMPLE
apture templates

#+BEGIN_SRC emacs-lisp 
  (setq org-capture-templates
        '(
          ("t" "Task" entry (file "")
            "* TODO %?\n:LOGBOOK:\n- Created %U\n:END:\n%i\n"
           :empty-lines 1)

          ("n" "Note" entry (file "")
           "* %? :muistiinpano:\n:LOGBOOK:\n- Created %U\n:END:\n%i\n"
           :empty-lines 1)

          ("m" "Meeting" entry (file "")
           "* %u %? :tapaminen:\n:LOGBOOK:\n- Created %U\n:END:\n"
           :clock-in t :clock-resume t  :empty-lines 1)

          ("c" "Phone call" entry (file "")
           "* %U %? :puhelu:\n:LOGBOOK:\n- Created %U\n:END:\n"
           :clock-in t :clock-resume t  :empty-lines 1)

          ("j" "Journal" entry (file+datetree "~/org/diary.org.gpg")
           "* %U\n\n%?")

          ("e" "Event" entry (file "")
           "* %? :tapahtuma:\n <%(org-read-date)> \n"
           )))

#+END_SRC


Following enables org-protocol handling. This means that url-like ~org-protocol://capture:/p/<url>/<title>/selection>~
are handled by the org mode capture.

#+begin_src emacs-lisp  
(require 'org-protocol)
#+end_src

Unfinished improvements for GTD.
#+BEGIN_SRC emacs-lisp
      (setq org-agenda-custom-commands
                  '(
                    ("A" "All tasks (for export)" todo ""
                    (
                    (org-agenda-overriding-header "Export")
                    (org-agenda-with-colors nil)
                    ) ("~/org/exported-lists/all.org"))
                    ("Gw" "Agenda työ"
                     (
                       (agenda "" ((org-agenda-span 1)             ; daily agenda
                          (org-deadline-warning-days 7)            ; 7 day advanced warning for deadlines
                          (org-agenda-todo-keyword-format "")
                          (org-agenda-scheduled-leaders '("" ""))
                          (org-agenda-prefix-format "%t%s")))
                      (tags-todo "+työ-@web" ((org-agenda-overriding-header "Työt") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                      (tags-todo "+työ+@web" ((org-agenda-overriding-header "Selain") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                      (tags-todo "+työ+puhelu" ((org-agenda-overriding-header "Puhelut") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                      )
                     (
                     (org-agenda-remove-tags t)
                     (org-agenda-todo-keyword-format "")                  
                     (org-agenda-prefix-format "  %?-12t% s")
                     (org-agenda-compact-blocks t)
                     ))
                    ("Gh" "Agenda koti"
                     (
                       (agenda "" ((org-agenda-span 1)             ; daily agenda
                          (org-deadline-warning-days 7)            ; 7 day advanced warning for deadlines
                          (org-agenda-todo-keyword-format "")
                          (org-agenda-scheduled-leaders '("" ""))
                          (org-agenda-prefix-format "%t%s")))
                      (tags-todo "-työ-@web" ((org-agenda-overriding-header "Työt") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                      (tags-todo "-työ+@web" ((org-agenda-overriding-header "Selain") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                      (tags-todo "-työ+puhelu" ((org-agenda-overriding-header "Puhelut") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                      )
                     (
                     (org-agenda-remove-tags t)
                     (org-agenda-todo-keyword-format "")                  
                     (org-agenda-prefix-format "  %?-12t% s")
                     (org-agenda-compact-blocks t)
                     ))
                    ))


        (defun my-org-agenda-skip-all-siblings-but-first ()
          "Skip all but the first non-done entry."
          (let (should-skip-entry)
            (unless (org-current-is-todo)
              (setq should-skip-entry t))
            (save-excursion
              (while (and (not should-skip-entry) (org-goto-sibling t))
              (when (org-current-is-todo)
                  (setq should-skip-entry t))))
            (when should-skip-entry
              (or (outline-next-heading)
                  (goto-char (point-max))))))

    (defun org-current-is-todo ()
          (string= "TODO" (org-get-todo-state)))

    (defun my-org-scheduled-for-today ()
           (ignore-errors
        (let ((subtree-end (save-excursion (org-end-of-subtree t)))
              (scheduled-day
                (time-to-days
                  (org-time-string-to-time
                    (org-entry-get nil "SCHEDULED"))))
              (now (time-to-days (current-time))))
           (and scheduled-day
                (not (= scheduled-day now))))))

    (defun my-org-agenda-skip-if-not-scheduled-today ()
    "If this function returns nil, the current match should not be skipped.
    Otherwise, the function must return a position from where the search
    should be continued."
    (ignore-errors
        (let ((subtree-end (save-excursion (org-end-of-subtree t)))
              (scheduled-day
                (time-to-days
                  (org-time-string-to-time
                    (org-entry-get nil "SCHEDULED"))))
              (now (time-to-days (current-time))))
           (and scheduled-day
                (not (= scheduled-day now))
                subtree-end))))

    (setq org-refile-targets '(("gtd.org.gpg"  :maxlevel . 1)
                               (org-agenda-files :tag . "prj")
                               ("polar-gtd.org.gpg" :maxlevel . 1)
                               ("someday.org.gpg" :maxlevel . 2)                             
                               ("polar-someday.org.gpg" :maxlevel . 2)))

    (setq org-tags-exclude-from-inheritance '("prj" "puhelu" "muistiinpano" "tapaaminen"))
      (setq org-stuck-projects '("+prj/-MAYBE-DONE-CANCELLED"
                                 ("TODO" "WAIT") ()))

      (defun my-org-with-entry ()
        (interactive)
        (save-excursion
          (org-entry-put nil "with" (read-string "With: " (org-entry-get nil "with")))))
      (global-set-key "\C-cw" 'my-org-with-entry)
#+END_SRC

I have created shell script [[file:sh/orgcapture.sh]] which opens Emacs in capture mode. I have also created service to
MacOS that uses the shell script when keyboard shortcut is used (see [[https://computers.tutsplus.com/tutorials/how-to-launch-any-app-with-a-keyboard-shortcut--mac-31463][instructions]]). Unfortunately Emacs catches all keys
and the same shortcut does not work within Emacs. Following binding enables the same shortcut in
Emacs.

#+BEGIN_SRC emacs-lisp 
  (global-set-key (kbd "C-S-s-o") 'org-capture)
#+END_SRC

** Calendar

See http://orgmode.org/worg/org-faq.html#Appointments/Diary

#+begin_src emacs-lisp 

(setq diary-file "~/org/diary")

(calendar-set-date-style 'european)

(setq calendar-week-start-day 1
      calendar-view-diary-initially-flag t
      calendar-mark-diary-entries-flag t)

(add-hook 'diary-display-hook 'diary-fancy-display)

#+end_src
** Emacsclient server

#+BEGIN_SRC emacs-lisp 
(setq server-socket-dir "~/.emacs.d/server")
(server-start)
#+END_SRC
