init.el

(setq org-directory "~/org")
(setq org-agenda-files (concat org-directory "/agenda"))
(setq org-default-notes-file (concat org-directory "/refile.org.gpg"))

(setq org-archive-location (concat org-directory "/archive.org.gpg::* From %s"))

(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-iswitchb)

(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (makefile . t)
   (shell . t)
   (js . t)
   (plantuml . t)
   (emacs-lisp  . t)
   (ditaa . t)
   ))

(setq org-log-into-drawer t)
(setq org-todo-keywords '((sequence  "TODO(t!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELLED(c@)")))

(setq org-capture-templates
      '(
        ("t" "Task" entry (file "")
          "* TODO %?\n:LOGBOOK:\n- Created %U\n:END:\n%i\n"
         :empty-lines 1)

        ("n" "Note" entry (file "")
         "* %? :muistiinpano:\n:LOGBOOK:\n- Created %U\n:END:\n%i\n"
         :empty-lines 1)

        ("m" "Meeting" entry (file "")
         "* %u %? :tapaminen:\n:LOGBOOK:\n- Created %U\n:END:\n"
         :clock-in t :clock-resume t  :empty-lines 1)

        ("c" "Phone call" entry (file "")
         "* %U %? :puhelu:\n:LOGBOOK:\n- Created %U\n:END:\n"
         :clock-in t :clock-resume t  :empty-lines 1)

        ("j" "Journal" entry (file+datetree "~/org/diary.org.gpg")
         "* %U\n\n%?")

        ("e" "Event" entry (file "")
         "* %? :tapahtuma:\n <%(org-read-date)> \n"
         )))

(require 'org-protocol)

(setq org-agenda-custom-commands
              '(
                ("A" "All tasks (for export)" todo ""
                (
                (org-agenda-overriding-header "Export")
                (org-agenda-with-colors nil)
                ) ("~/org/exported-lists/all.org"))
                ("Gw" "Agenda työ"
                 (
                   (agenda "" ((org-agenda-span 1)             ; daily agenda
                      (org-deadline-warning-days 7)            ; 7 day advanced warning for deadlines
                      (org-agenda-todo-keyword-format "")
                      (org-agenda-scheduled-leaders '("" ""))
                      (org-agenda-prefix-format "%t%s")))
                  (tags-todo "+työ-@web" ((org-agenda-overriding-header "Työt") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                  (tags-todo "+työ+@web" ((org-agenda-overriding-header "Selain") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                  (tags-todo "+työ+puhelu" ((org-agenda-overriding-header "Puhelut") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                  )
                 (
                 (org-agenda-remove-tags t)
                 (org-agenda-todo-keyword-format "")                  
                 (org-agenda-prefix-format "  %?-12t% s")
                 (org-agenda-compact-blocks t)
                 ))
                ("Gh" "Agenda koti"
                 (
                   (agenda "" ((org-agenda-span 1)             ; daily agenda
                      (org-deadline-warning-days 7)            ; 7 day advanced warning for deadlines
                      (org-agenda-todo-keyword-format "")
                      (org-agenda-scheduled-leaders '("" ""))
                      (org-agenda-prefix-format "%t%s")))
                  (tags-todo "-työ-@web" ((org-agenda-overriding-header "Työt") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                  (tags-todo "-työ+@web" ((org-agenda-overriding-header "Selain") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                  (tags-todo "-työ+puhelu" ((org-agenda-overriding-header "Puhelut") (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))
                  )
                 (
                 (org-agenda-remove-tags t)
                 (org-agenda-todo-keyword-format "")                  
                 (org-agenda-prefix-format "  %?-12t% s")
                 (org-agenda-compact-blocks t)
                 ))
                ))


    (defun my-org-agenda-skip-all-siblings-but-first ()
      "Skip all but the first non-done entry."
      (let (should-skip-entry)
        (unless (org-current-is-todo)
          (setq should-skip-entry t))
        (save-excursion
          (while (and (not should-skip-entry) (org-goto-sibling t))
          (when (org-current-is-todo)
              (setq should-skip-entry t))))
        (when should-skip-entry
          (or (outline-next-heading)
              (goto-char (point-max))))))

(defun org-current-is-todo ()
      (string= "TODO" (org-get-todo-state)))

(defun my-org-scheduled-for-today ()
       (ignore-errors
    (let ((subtree-end (save-excursion (org-end-of-subtree t)))
          (scheduled-day
            (time-to-days
              (org-time-string-to-time
                (org-entry-get nil "SCHEDULED"))))
          (now (time-to-days (current-time))))
       (and scheduled-day
            (not (= scheduled-day now))))))

(defun my-org-agenda-skip-if-not-scheduled-today ()
"If this function returns nil, the current match should not be skipped.
Otherwise, the function must return a position from where the search
should be continued."
(ignore-errors
    (let ((subtree-end (save-excursion (org-end-of-subtree t)))
          (scheduled-day
            (time-to-days
              (org-time-string-to-time
                (org-entry-get nil "SCHEDULED"))))
          (now (time-to-days (current-time))))
       (and scheduled-day
            (not (= scheduled-day now))
            subtree-end))))

(setq org-refile-targets '(("gtd.org.gpg"  :maxlevel . 1)
                           (org-agenda-files :tag . "prj")
                           ("polar-gtd.org.gpg" :maxlevel . 1)
                           ("someday.org.gpg" :maxlevel . 2)                             
                           ("polar-someday.org.gpg" :maxlevel . 2)))

(setq org-tags-exclude-from-inheritance '("prj" "puhelu" "muistiinpano" "tapaaminen"))
  (setq org-stuck-projects '("+prj/-MAYBE-DONE-CANCELLED"
                             ("TODO" "WAIT") ()))

  (defun my-org-with-entry ()
    (interactive)
    (save-excursion
      (org-entry-put nil "with" (read-string "With: " (org-entry-get nil "with")))))
  (global-set-key "\C-cw" 'my-org-with-entry)

(global-set-key (kbd "C-S-s-o") 'org-capture)

(setq diary-file "~/org/diary")

(calendar-set-date-style 'european)

(setq calendar-week-start-day 1
      calendar-view-diary-initially-flag t
      calendar-mark-diary-entries-flag t)

(add-hook 'diary-display-hook 'diary-fancy-display)

(setq server-socket-dir "~/.emacs.d/server")
(server-start)
