init.org
** New prefix key: Control-q

~Control-q~ is bound to ~quoted-insert~ by default. That command is
not use so often and the key is perfectly located for prefix key.
So it is unset here to allow it to be re-used later.

#+BEGIN_SRC emacs-lisp 
  (global-unset-key (kbd "C-q"))
#+END_SRC

** Vertico, Marginalia, Consult, Orderless

#+BEGIN_SRC emacs-lisp
  (use-package vertico
  :straight t
  :straight t
  :init
  (vertico-mode))

  (use-package marginalia
  :straight t
  :straight t
  :init
  (marginalia-mode))

  (use-package consult
  :straight t
  :straight t
  :bind
  (("C-s" . consult-line)
   ("C-x b" . consult-buffer)
   ("M-y" . consult-yank-pop)))

  (use-package orderless
  :straight t
  :init
  (setq completion-styles '(orderless)))
#+END_SRC

** Corfu, Cape, Kind-icon

In-buffer completion UI via =completion-at-point= (capf). Corfu shows a popup
at point for code completion; Cape adds extra capf sources (dabbrev, file
names, keywords) so Corfu has something to complete even outside LSP buffers;
Kind-icon renders icons next to candidates indicating their kind (function,
variable, snippet, ...). This pairs with Vertico/Consult (same ecosystem,
same =orderless= filtering) and feeds directly off lsp-mode's
=lsp-completion-provider :capf=, so no LSP config changes are required.

#+BEGIN_SRC emacs-lisp
  (use-package corfu
    :straight t
    :init
    (global-corfu-mode)
    (corfu-popupinfo-mode)
    :custom
    (corfu-auto t)
    (corfu-auto-delay 0.15)
    (corfu-auto-prefix 2)
    (corfu-cycle t)
    (corfu-preselect 'prompt)
    (corfu-popupinfo-delay '(0.5 . 0.2)))

  (use-package cape
    :straight t
    :init
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-keyword))

  (use-package kind-icon
    :straight t
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default)
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+END_SRC

=orderless= works well during completion, but for capf it helps to let the
basic style match literal prefixes first, so LSP's own sorting is not
disrupted. Configure per-category overrides:

#+BEGIN_SRC emacs-lisp
  (setq completion-category-overrides
        '((file (styles basic partial-completion))
          (eglot (styles orderless))
          (lsp-capf (styles orderless))))
#+END_SRC

** Misc


#+BEGIN_SRC emacs-lisp
  ;;; turn on syntax highlighting
  (global-font-lock-mode 1)

  ;; Mustache mode
  (require 'mustache-mode)

  (defun iwb ()
    "indent whole buffer"
    (interactive)
    (delete-trailing-whitespace)
    (indent-region (point-min) (point-max) nil)
    (untabify (point-min) (point-max)))

  (defun previous-line-insert-newline ()
    "Moves line up and creates empty line"
    (interactive)
    (previous-line)
    (end-of-line)
    (newline-and-indent)
    )

  (defun next-line-insert-newline ()
    "Moves line up and creates empty line"
    (interactive)
    (end-of-line)
    (newline-and-indent)
    )

  (setq line-move-visual nil)
  (put 'scroll-left 'disabled nil)

  ;; (global-set-key (kbd "C-,") 'backward-paragraph)
  ;; (global-set-key (kbd "C-.") 'forward-paragraph)
  ;; (global-set-key  (kbd "C-`")    'shell-command)
  ;; (global-set-key  (kbd "M-`")    'shell-command-on-region)


  (global-set-key (kbd "C-c f") 'iwb)

  ;; Moving from window to window using arrows
  (global-set-key (kbd "<left>")  'windmove-left)
  (global-set-key (kbd "<right>") 'windmove-right)
  (global-set-key (kbd "<up>")    'windmove-up)
  (global-set-key (kbd "<down>")  'windmove-down)

  (global-set-key (kbd "M-n") 'next-line-insert-newline)
  (global-set-key (kbd "M-p") 'previous-line-insert-newline)



  (global-unset-key (kbd "C-<SPC>"))
  (global-set-key (kbd "C-<SPC>") 'set-mark-command)



  (global-set-key (kbd "s-<left>")  'windmove-left)
  (global-set-key (kbd "s-<right>") 'windmove-right)
  (global-set-key (kbd "s-<up>")    'windmove-up)
  (global-set-key (kbd "s-<down>")  'windmove-down)

  (put 'upcase-region 'disabled nil)
  (put 'scroll-left 'disabled nil)

  (global-set-key (kbd "C-q o")  'find-file-at-point)

  (global-set-key (kbd "C-q i")  'quoted-insert)
#+END_SRC

** Shell stuff 
*** Convient way to create new shell

I often need shell. But default ~M-x shell~ will throw back to the already
created shell. Many times this is not what I want.

#+begin_src emacs-lisp 
    (defun ps/open-new-shell ()
      (interactive)

      (let (
            (currentbuf (get-buffer-window (current-buffer)))
            (newbuf     (generate-new-buffer-name "*shell*"))
           )
       (generate-new-buffer newbuf)
       (set-window-dedicated-p currentbuf nil)
       (set-window-buffer currentbuf newbuf)
       (shell newbuf)
      )
    )
  (defun ps/open-new-local-shell ()
    "Open a new shell buffer in home directory."
    (interactive)
    (let ((default-directory "~/"))
          (ps/open-new-shell)))

  (global-set-key (kbd "C-q s")  'ps/open-new-shell)
  (global-set-key (kbd "C-q C-s")  'ps/open-new-local-shell)
#+end_src

*** Jumping to the root directory of repository

Sometimes it is convenient to jump to the root directory of the repository.

#+begin_src emacs-lisp 
(defun pw/shell-cd-to-vc-root ()
"Jumps to the root directory of version controled directory structure."
  (interactive)
  (let* ((proc (get-buffer-process (current-buffer)))
         (pmark (process-mark proc))
	 (started-at-pmark (= (point) (marker-position pmark)))         
         (root (vc-root-dir))
         (cmd (concat "cd " root)))
    (save-excursion
      (goto-char pmark)
      (unless comint-process-echoes     
         (insert cmd) (insert "\n"))
      (sit-for 0)			; force redisplay      
      (cd root)
      (comint-send-string proc cmd)
      (comint-send-string proc "\n")
      (set-marker pmark (point))
      )
    
    (if started-at-pmark (goto-char (marker-position pmark)))))

(defun pw/dired-cd-to-vc-root ()
(interactive)
(find-file (vc-root-dir)))

#+end_src

This function can be binded to key sequence when shell is activated.
#+begin_src emacs-lisp 
  (add-hook 'comint-mode-hook (lambda ()
                              (define-key comint-mode-map (kbd "C-q c r") 'pw/shell-cd-to-vc-root)
                              ))

  (add-hook 'dired-mode-hook (lambda ()
                              (define-key dired-mode-map (kbd "C-q c r") 'pw/dired-cd-to-vc-root)
                              ))

#+end_src
*** Fish-powered shell completion with annotations

Emacs =shell-mode= normally gets completions from bash, which provides
only bare candidate names without descriptions. The capf below calls
fish directly and returns a completion table with an annotation
function, so Corfu displays descriptions next to each candidate. Fish
must be installed (=apt install fish=) but is not used as the default
shell --- it runs behind the scenes only for completion queries.

#+begin_src emacs-lisp
  (defvar ps/fish-executable (executable-find "fish")
    "Path to the fish shell, or nil if not installed.")

  (defun ps/fish-completion-at-point ()
    "Completion-at-point function that queries fish for annotated candidates."
    (when (get-buffer-process (current-buffer))
      (let* ((end (point))
             (start (save-excursion
                      (skip-chars-backward "^ \t\n")
                      (point)))
             (line (buffer-substring-no-properties
                    (save-excursion (comint-bol) (point))
                    end))
             (raw (with-output-to-string
                    (with-current-buffer standard-output
                      (call-process ps/fish-executable nil t nil
                                    "-c" (format "complete -C%s"
                                                 (shell-quote-argument line))))))
             (results (mapcar (lambda (l)
                                (let ((parts (split-string l "\t")))
                                  (cons (car parts) (cadr parts))))
                              (split-string raw "\n" t))))
        (when results
          (list start end
                (mapcar #'car results)
                :annotation-function
                (lambda (c)
                  (when-let* ((desc (cdr (assoc c results))))
                    (concat "  " desc))))))))

  (if ps/fish-executable
      (add-hook 'shell-mode-hook
                (lambda ()
                  (add-hook 'completion-at-point-functions
                            #'ps/fish-completion-at-point nil t)))
    (display-warning 'fish-completion
                     "fish shell not found; install it for shell completion descriptions"
                     :warning))
#+end_src

