init.el

(global-unset-key (kbd "C-q"))

(use-package vertico
:straight t
:straight t
:init
(vertico-mode))

(use-package marginalia
:straight t
:straight t
:init
(marginalia-mode))

(use-package consult
:straight t
:straight t
:bind
(("C-s" . consult-line)
 ("C-x b" . consult-buffer)
 ("M-y" . consult-yank-pop)))

(use-package orderless
:straight t
:init
(setq completion-styles '(orderless)))

(use-package corfu
  :straight t
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode)
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0.15)
  (corfu-auto-prefix 2)
  (corfu-cycle t)
  (corfu-preselect 'prompt)
  (corfu-popupinfo-delay '(0.5 . 0.2)))

(use-package cape
  :straight t
  :init
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-keyword))

(use-package kind-icon
  :straight t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default)
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(setq completion-category-overrides
      '((file (styles basic partial-completion))
        (eglot (styles orderless))
        (lsp-capf (styles orderless))))

;;; turn on syntax highlighting
(global-font-lock-mode 1)

;; Mustache mode
(require 'mustache-mode)

(defun iwb ()
  "indent whole buffer"
  (interactive)
  (delete-trailing-whitespace)
  (indent-region (point-min) (point-max) nil)
  (untabify (point-min) (point-max)))

(defun previous-line-insert-newline ()
  "Moves line up and creates empty line"
  (interactive)
  (previous-line)
  (end-of-line)
  (newline-and-indent)
  )

(defun next-line-insert-newline ()
  "Moves line up and creates empty line"
  (interactive)
  (end-of-line)
  (newline-and-indent)
  )

(setq line-move-visual nil)
(put 'scroll-left 'disabled nil)

;; (global-set-key (kbd "C-,") 'backward-paragraph)
;; (global-set-key (kbd "C-.") 'forward-paragraph)
;; (global-set-key  (kbd "C-`")    'shell-command)
;; (global-set-key  (kbd "M-`")    'shell-command-on-region)


(global-set-key (kbd "C-c f") 'iwb)

;; Moving from window to window using arrows
(global-set-key (kbd "<left>")  'windmove-left)
(global-set-key (kbd "<right>") 'windmove-right)
(global-set-key (kbd "<up>")    'windmove-up)
(global-set-key (kbd "<down>")  'windmove-down)

(global-set-key (kbd "M-n") 'next-line-insert-newline)
(global-set-key (kbd "M-p") 'previous-line-insert-newline)



(global-unset-key (kbd "C-<SPC>"))
(global-set-key (kbd "C-<SPC>") 'set-mark-command)



(global-set-key (kbd "s-<left>")  'windmove-left)
(global-set-key (kbd "s-<right>") 'windmove-right)
(global-set-key (kbd "s-<up>")    'windmove-up)
(global-set-key (kbd "s-<down>")  'windmove-down)

(put 'upcase-region 'disabled nil)
(put 'scroll-left 'disabled nil)

(global-set-key (kbd "C-q o")  'find-file-at-point)

(global-set-key (kbd "C-q i")  'quoted-insert)

(defun ps/open-new-shell ()
    (interactive)

    (let (
          (currentbuf (get-buffer-window (current-buffer)))
          (newbuf     (generate-new-buffer-name "*shell*"))
         )
     (generate-new-buffer newbuf)
     (set-window-dedicated-p currentbuf nil)
     (set-window-buffer currentbuf newbuf)
     (shell newbuf)
    )
  )
(defun ps/open-new-local-shell ()
  "Open a new shell buffer in home directory."
  (interactive)
  (let ((default-directory "~/"))
        (ps/open-new-shell)))

(global-set-key (kbd "C-q s")  'ps/open-new-shell)
(global-set-key (kbd "C-q C-s")  'ps/open-new-local-shell)

(defun pw/shell-cd-to-vc-root ()
"Jumps to the root directory of version controled directory structure."
  (interactive)
  (let* ((proc (get-buffer-process (current-buffer)))
         (pmark (process-mark proc))
	 (started-at-pmark (= (point) (marker-position pmark)))         
         (root (vc-root-dir))
         (cmd (concat "cd " root)))
    (save-excursion
      (goto-char pmark)
      (unless comint-process-echoes     
         (insert cmd) (insert "\n"))
      (sit-for 0)			; force redisplay      
      (cd root)
      (comint-send-string proc cmd)
      (comint-send-string proc "\n")
      (set-marker pmark (point))
      )
    
    (if started-at-pmark (goto-char (marker-position pmark)))))

(defun pw/dired-cd-to-vc-root ()
(interactive)
(find-file (vc-root-dir)))

(add-hook 'comint-mode-hook (lambda ()
                            (define-key comint-mode-map (kbd "C-q c r") 'pw/shell-cd-to-vc-root)
                            ))

(add-hook 'dired-mode-hook (lambda ()
                            (define-key dired-mode-map (kbd "C-q c r") 'pw/dired-cd-to-vc-root)
                            ))

(defvar ps/fish-executable (executable-find "fish")
  "Path to the fish shell, or nil if not installed.")

(defun ps/fish-completion-at-point ()
  "Completion-at-point function that queries fish for annotated candidates."
  (when (get-buffer-process (current-buffer))
    (let* ((end (point))
           (start (save-excursion
                    (skip-chars-backward "^ \t\n")
                    (point)))
           (line (buffer-substring-no-properties
                  (save-excursion (comint-bol) (point))
                  end))
           (raw (with-output-to-string
                  (with-current-buffer standard-output
                    (call-process ps/fish-executable nil t nil
                                  "-c" (format "complete -C%s"
                                               (shell-quote-argument line))))))
           (results (mapcar (lambda (l)
                              (let ((parts (split-string l "\t")))
                                (cons (car parts) (cadr parts))))
                            (split-string raw "\n" t))))
      (when results
        (list start end
              (mapcar #'car results)
              :annotation-function
              (lambda (c)
                (when-let* ((desc (cdr (assoc c results))))
                  (concat "  " desc))))))))

(if ps/fish-executable
    (add-hook 'shell-mode-hook
              (lambda ()
                (add-hook 'completion-at-point-functions
                          #'ps/fish-completion-at-point nil t)))
  (display-warning 'fish-completion
                   "fish shell not found; install it for shell completion descriptions"
                   :warning))
