init.org
*** GPTel autocomplete in shell-mode

GPTel autocomplete works in shell buffers with two safety guards:
it only triggers when the cursor is at the command prompt (after the
process mark, not up in scrollback) and when the shell is idle (no
command currently producing output).  Recent terminal output provides
context so the LLM can suggest commands informed by error messages,
directory listings, and other output.

#+begin_src emacs-lisp
  (defvar ps/gptel-shell-context-lines 100
    "Lines of recent shell output to include as context for gptel autocomplete.")

  (defvar ps/gptel-shell-idle-threshold 1.0
    "Seconds since last output before the shell is considered idle.")

  (defvar-local ps/shell-last-output-time nil
    "Time of last comint output in this buffer.")

  (defun ps/shell-track-output (&rest _)
    "Record the time of the latest shell output."
    (setq ps/shell-last-output-time (current-time)))

  (add-hook 'shell-mode-hook
            (lambda ()
              (add-hook 'comint-output-filter-functions
                        #'ps/shell-track-output nil t)))

  (defun ps/gptel-shell-idle-prompt-p ()
    "Non-nil when point is at an idle shell prompt."
    (and (derived-mode-p 'shell-mode)
         (comint-after-pmark-p)
         (or (null ps/shell-last-output-time)
             (> (float-time (time-since ps/shell-last-output-time))
                ps/gptel-shell-idle-threshold))))

  (defun ps/gptel-shell-guard (orig &rest args)
    "In shell-mode, only trigger gptel autocomplete at an idle prompt."
    (if (derived-mode-p 'shell-mode)
        (when (ps/gptel-shell-idle-prompt-p)
          (apply orig args))
      (apply orig args)))

  (defun ps/gptel-shell-context (orig &rest args)
    "Override context line count for shell-mode buffers."
    (if (derived-mode-p 'shell-mode)
        (let ((gptel-autocomplete-before-context-lines ps/gptel-shell-context-lines)
              (gptel-autocomplete-after-context-lines 0))
          (apply orig args))
      (apply orig args)))

  (advice-add 'gptel--post-command :around #'ps/gptel-shell-guard)
  (advice-add 'gptel-complete :around #'ps/gptel-shell-context)
#+end_src

*** No passwords in shell

#+BEGIN_SRC emacs-lisp
;; No passwords show in shell
(add-hook 'comint-output-filter-functions
          'comint-watch-for-password-prompt)
#+END_SRC

** Avy - for jumping around

#+BEGIN_SRC emacs-lisp
      (use-package avy
       :straight t
       :bind (
              ("C-." . avy-goto-char)
              ("C-q q". avy-pop-mark)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  ;; 
  ;; enable a more powerful jump back function from ace jump mode
  ;;
  (autoload
    'ace-jump-mode-pop-mark
    "ace-jump-mode"
    "Ace jump back:-)"
    t)
  (eval-after-load "ace-jump-mode"
    '(ace-jump-mode-enable-mark-sync))
  (define-key global-map (kbd "C-q q") 'ace-jump-mode-pop-mark)
  (define-key global-map (kbd "C-.") 'ace-jump-mode)
#+END_SRC
** Smart jump back

Pop the global mark ring, but reuse an existing window if the target buffer is
already visible rather than switching the current window's buffer.

#+BEGIN_SRC emacs-lisp
  (defun my/pop-global-mark-smart ()
    "Pop global mark, reusing existing window if buffer is already visible."
    (interactive)
    (let ((ring global-mark-ring))
      (while (and ring (not (marker-buffer (car ring))))
        (setq global-mark-ring (cdr global-mark-ring))
        (setq ring global-mark-ring))
      (if (not ring)
          (message "No global mark set")
        (let* ((mark (car ring))
               (buf (marker-buffer mark))
               (pos (marker-position mark))
               (win (get-buffer-window buf)))
          (setq global-mark-ring (nconc (cdr ring) (list mark)))
          (if win
              (progn (select-window win) (goto-char pos))
            (switch-to-buffer buf)
            (goto-char pos))))))

  (global-set-key (kbd "C-x C-SPC") #'my/pop-global-mark-smart)
#+END_SRC

** COMMENT File editing modes
*** COMMENT CSV-mode
#+BEGIN_SRC emacs-lisp 
;; CSV Mode
(el-get-bundle csv-mode)
(require 'csv-mode)
#+END_SRC
*** COMMENT Docker-mode
#+BEGIN_SRC emacs-lisp 
(el-get-bundle dockerfile-mode)
;;; Dockerfile mode
(require 'dockerfile-mode)
(add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode))
#+END_SRC
*** Yaml-mode
#+BEGIN_SRC emacs-lisp 
(el-get-bundle yaml-mode)
#+END_SRC
** COMMENT Edit server

Edit server allows editing content from web browser. See for example [[https://chrome.google.com/webstore/detail/edit-with-emacs/ljobjlafonikaiipfkggjbhkghgicgoh][edit-with-emacs]] Chrome extension.

This is disabled as there seems to be some kind of load problem at the moment [2020-04-14].

#+BEGIN_SRC emacs-lisp :tangle no
(el-get-bundle edit-server)
(edit-server-start)
#+END_SRC

** COMMENT Expand region
#+BEGIN_SRC emacs-lisp 
(el-get-bundle expand-region)
(require 'expand-region)
(global-set-key (kbd "C-q C-e") 'er/expand-region)
#+END_SRC
** COMMENT Setup Go environment


#+BEGIN_SRC emacs-lisp 
(defun system-has-go () "Tests wether go is installed or not" 
       (condition-case nil
           (progn
             (start-process "" nil "go")
             t
             )
         (error nil))
       )
(defun makeinfo-version () "Make info version"
       (with-temp-buffer
          (call-process "makeinfo" nil t nil "--version")
          (goto-char (point-min))
          (re-search-forward "[0-9]\\{1,2\\}\\(\\.[0-9]\\{1,2\\}\\)\\{1,2\\}")
          (let ((s (match-beginning 0)) (e (point)))
            (mapcar
             'string-to-number
             (split-string (buffer-substring s e) "\\.")))))

(defun setup-go () "Install go environment with el-get"
       (el-get-bundle go-mode)
       (el-get-bundle dash)
       
       ;; Require makeinfo which major version is 5 or more
       (if (< 4 (car (makeinfo-version)))
           (progn
           (el-get-bundle flycheck)   
           ;; go get github.com/dougm/goflymake
           (add-to-list 'load-path "~/src/github.com/dougm/goflymake")
           (require 'go-flycheck))
           ))

       ;; go get github.com/nsf/gocode
       (el-get-bundle go-autocomplete)
       (require 'go-autocomplete)

       (add-hook 'go-mode-hook 
                 (lambda ()
                   (define-key go-mode-map (kbd "C-q j") 'godef-jump)
                   (define-key go-mode-map (kbd "C-q q") 'pop-global-mark)
                   (add-hook 'before-save-hook 'gofmt-before-save))
                 )

(if (system-has-go) (setup-go))
#+END_SRC

** COMMENT Multicursors
#+BEGIN_SRC emacs-lisp 
(el-get-bundle multiple-cursors)

(global-set-key (kbd "C-c m <return>") 'set-rectangular-region-anchor)
(global-set-key (kbd "C-c m c") 'mc/edit-lines)
(global-set-key (kbd "C-c m a") 'mc/mark-all-like-this)
(global-set-key (kbd "C-c m .") 'mc/mark-next-like-this)
(global-set-key (kbd "C-c m ,") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c m m") 'mc/mark-more-like-this-extended)
#+END_SRC

** COMMENT Yasniplet and autocomplete
#+BEGIN_SRC emacs-lisp 
(el-get-bundle yasnippet)
(el-get-bundle auto-complete)


(require 'yasnippet)
(require 'auto-complete)
(require 'auto-complete-config)
;;(require 'auto-complete-yasnippet)

(ac-config-default)
;(global-set-key (kbd "C-<tab>")  'yas-expand)

(setq ac-source-yasnippet nil)

;;; auto complete mod
;;; should be loaded after yasnippet so that they can work together

(add-to-list 'ac-dictionary-directories "~/.emacs.d/ac-dict")

;;; set the trigger key so that it can work together with yasnippet on tab key,
;;; if the word exists in yasnippet, pressing tab will cause yasnippet to
;;; activate, otherwise, auto-complete will
(ac-set-trigger-key "<tab>")



;; (setq-default ac-sources
;;       '(
;;         ;; ac-source-semantic
;;         ac-source-yasnippet
;;         ac-source-abbrev
;;         ac-source-words-in-buffer
;;         ac-source-words-in-all-buffer
;;         ;; ac-source-imenu
;;         ac-source-files-in-current-dir
;;         ac-source-filename
;;         )
;;       )

(yas-global-mode 1)
(global-auto-complete-mode 1)

#+END_SRC
** Buffer switching

One common task is to switch between two buffers.
Suspend frame is not very usefull command so, it is
recycled to change the buffer.

#+begin_src emacs-lisp 
(global-set-key (kbd "C-z")  'mode-line-other-buffer)
#+end_src

** IBuffers

#+begin_src emacs-lisp 
   (global-set-key (kbd "C-x C-b") 'ibuffer)
   (autoload 'ibuffer "ibuffer" "List buffers." t)

    (setq ibuffer-saved-filter-groups
            (quote (("default"
                     ("dired" (mode . dired-mode))
                     ("org" (or
                             (mode . org-mode)
                             (mode . org-agenda-mode)                           
                             ))
                     ("emacs" (or
                               (name . "^\\*scratch\\*$")
                               (name . "^\\*Messages\\*$")))
                     ("shell" (or
                              (mode . shell-mode)
                              (mode . term-mode)
                              ))))))

#+end_src

** COMMENT WCheck mode

Set up wcheck mode for spell checking

#+BEGIN_SRC emacs-lisp
  (el-get-bundle 'wcheck-mode)
  (global-set-key (kbd "C-x w") 'wcheck-mode)
  (add-hook 'wcheck-mode-hook
            (lambda ()
              (define-key wcheck-mode-map (kbd "C-q l") 'wcheck-change-language)
              (define-key wcheck-mode-map (kbd "C-q c") 'wcheck-actions)
              (define-key wcheck-mode-map (kbd "C-q n") 'wcheck-jump-forward)
              (define-key wcheck-mode-map (kbd "C-q p") 'wcheck-jump-backward)
              ))

  (setq wcheck-language-data
        '(
          ("British English"
           (program . "/usr/bin/enchant")
           (args "-l" "-d" "british")
           (action-program . "/usr/bin/ispell")
           (action-args "-a" "-d" "british")
           (action-parser . wcheck-parser-ispell-suggestions))

          ("Finnish"
           (program . "/usr/bin/enchant")
           (args "-l" "-d" "fi")
           (action-program . "/usr/bin/enchant")
           (action-args "-a" "-d" "fi")
           (action-parser . wcheck-parser-ispell-suggestions))

          ))

  (wcheck-change-language "British English" 'GLOBAL)

#+END_SRC

** Ediff

Keep everything in a single frame — no separate control frame.

#+begin_src emacs-lisp
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src

** Magit for using git

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :straight t
    :bind ("C-x g" . magit-status))

  (use-package treemacs-magit  :straight t :after (treemacs magit))
#+END_SRC

** Compilation

Scroll the compilation buffer to follow output as it arrives. On a successful
build, automatically close the compilation window after a short delay.

#+BEGIN_SRC emacs-lisp
  (setq compilation-scroll-output t)

  (defun my/compilation-auto-close (buf status)
    (when (string= status "finished\n")
      (run-at-time 2 nil
                   (lambda ()
                     (when-let (win (get-buffer-window buf t))
                       (delete-window win))))))

  (add-hook 'compilation-finish-functions #'my/compilation-auto-close)
#+END_SRC

** Projectile

Project management with automatic project type detection. Projectile recognises
build files (=Makefile=, =pom.xml=, =build.gradle=, =package.json=,
=Cargo.toml=, etc.) and provides compile, test, and run commands for each. The
keymap is bound to =C-c p=.

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :straight t
    :init
    (projectile-mode +1)
    :config
    (setq compilation-read-command nil)
    (setq projectile-project-search-path '("~/src"))
    (projectile-add-known-project "~/.emacs.d/")
    :bind-keymap
    ("C-c p" . projectile-command-map))
#+END_SRC

