init.org
** LSP Mode

Language Server Protocol support for code intelligence features. LSP keybindings
are under =C-c l= prefix. Completion uses =completion-at-point= (capf) so it
integrates with whatever completion framework is active (e.g. Vertico/Corfu).

=lsp-completion-provider= is set to =:none= so lsp-mode does not attempt to
autoconfigure company-mode (which would emit a warning on every LSP start
when Corfu is used instead). =lsp-completion-mode= still registers
=lsp-completion-at-point= into =completion-at-point-functions=, which Corfu
picks up.

#+BEGIN_SRC emacs-lisp
(setenv "LSP_USE_PLISTS" "true")
(setq lsp-use-plists t)

(use-package lsp-mode
  :straight t
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (setq lsp-enable-snippet t
        lsp-enable-symbol-highlighting t
        lsp-enable-links t
        lsp-signature-auto-activate t
        lsp-signature-render-documentation t
        lsp-headerline-breadcrumb-enable t
        lsp-modeline-code-actions-enable t
        lsp-diagnostics-provider :auto
        lsp-completion-provider :none
        lsp-idle-delay 0.5)
  :hook
  ((lsp-mode . lsp-enable-which-key-integration)))

(use-package lsp-ui
  :straight t
  :commands lsp-ui-mode
  :config
  (setq lsp-ui-doc-enable t
        lsp-ui-doc-position 'at-point
        lsp-ui-doc-show-with-cursor t
        lsp-ui-sideline-enable t
        lsp-ui-sideline-show-hover t))

(use-package lsp-treemacs
  :straight t
  :after (lsp-mode treemacs)
  :commands lsp-treemacs-errors-list)
#+END_SRC

*** Consult-LSP Integration

Integrates LSP with the Consult completion framework, providing fuzzy search
for symbols and diagnostics. Key commands:

- =consult-lsp-symbols= -- Search for symbols in the workspace
- =consult-lsp-diagnostics= -- Browse diagnostics with Consult
- =consult-lsp-file-symbols= -- Search for symbols in the current file

#+BEGIN_SRC emacs-lisp
  (use-package consult-lsp
    :straight t
    :after (consult lsp-mode)
    :commands (consult-lsp-symbols consult-lsp-diagnostics consult-lsp-file-symbols))
#+END_SRC

*** LSP Booster

[[https://github.com/blahgeek/emacs-lsp-booster][emacs-lsp-booster]] is an external program that wraps any LSP server to
accelerate communication between Emacs and the server. It works by converting
JSON messages from the language server into Emacs bytecode, which Emacs can
evaluate significantly faster than it can parse raw JSON. This is especially
noticeable with heavy language servers like =jdtls= (Java) that produce large
responses.

The integration requires two pieces of advice:

1. *JSON parsing advice* -- When the booster is active, server responses arrive
   as Emacs bytecode (prefixed with =#=) rather than JSON. This advice checks
   for that prefix and evaluates the bytecode directly, falling back to normal
   JSON parsing for unmodified responses. It advises either =json-parse-buffer=
   (native JSON, Emacs 27+) or =json-read= (older Emacs), depending on which
   is available.

2. *Command wrapping advice* -- This advises =lsp-resolve-final-command= to
   prepend =emacs-lsp-booster= to the server launch command, so the booster
   acts as a transparent proxy between Emacs and the actual server process. It
   only activates when all of the following are true:
   - The =emacs-lsp-booster= binary is found on =PATH=
   - The directory is local (not a TRAMP remote connection)
   - Emacs is not using native JSON-RPC (Emacs 30+ built-in LSP support)
   - It is not a test/dry-run invocation

If =emacs-lsp-booster= is not installed, the advice functions are inert and LSP
works exactly as it would without them.

**** Automatic installation

The following function automatically downloads the latest pre-built binary from
GitHub when =emacs-lsp-booster= is not found on =PATH=. It queries the GitHub
releases API to find the latest version, selects the correct archive for the
current platform (Linux or macOS, x86_64 only), downloads and extracts it to
=~/.emacs.d/lsp-booster/=, and makes it executable. The download happens
asynchronously so it does not block Emacs startup -- a message is displayed when
the installation completes. On subsequent startups where the binary already
exists, this function does nothing.

You can also install manually if you prefer:

#+BEGIN_EXAMPLE
  # With Cargo (Rust toolchain required):
  cargo install emacs-lsp-booster

  # Or download a pre-built binary from the GitHub releases page
  # and place it somewhere on PATH.
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp
  (defvar lsp-booster-install-dir
    (expand-file-name "lsp-booster" user-emacs-directory)
    "Directory where emacs-lsp-booster binary will be installed.")

  (defun lsp-booster--github-asset-name ()
    "Return the expected release asset name suffix for this platform."
    (let ((arch (car (split-string system-configuration "-"))))
      (cond
       ((and (eq system-type 'gnu/linux) (string= arch "x86_64"))
        "x86_64-unknown-linux-musl.zip")
       ((and (eq system-type 'darwin) (string= arch "x86_64"))
        "x86_64-apple-darwin.zip")
       (t nil))))

  (defun lsp-booster--ensure-installed ()
    "Download and install emacs-lsp-booster if not already on PATH.
Queries the GitHub releases API for the latest version, downloads
the appropriate pre-built binary, and extracts it to `lsp-booster-install-dir'."
    (when (and (not (executable-find "emacs-lsp-booster"))
               (lsp-booster--github-asset-name))
      (let ((install-dir lsp-booster-install-dir))
        (unless (file-directory-p install-dir)
          (make-directory install-dir t))
        (unless (member install-dir exec-path)
          (add-to-list 'exec-path install-dir)
          (setenv "PATH" (concat install-dir ":" (getenv "PATH"))))
        (message "emacs-lsp-booster not found, downloading from GitHub...")
        (url-retrieve
         "https://api.github.com/repos/blahgeek/emacs-lsp-booster/releases/latest"
         (lambda (_status)
           (goto-char url-http-end-of-headers)
           (let* ((release (json-parse-buffer :object-type 'alist))
                  (assets (alist-get 'assets release))
                  (suffix (lsp-booster--github-asset-name))
                  (asset (seq-find
                          (lambda (a)
                            (and (string-suffix-p suffix (alist-get 'name a))
                                 (not (string-suffix-p ".sha256sum" (alist-get 'name a)))))
                          assets))
                  (url (alist-get 'browser_download_url asset)))
             (if (not url)
                 (message "emacs-lsp-booster: no matching release asset found for %s" suffix)
               (let ((zip-file (expand-file-name "emacs-lsp-booster.zip" temporary-file-directory)))
                 (url-copy-file url zip-file t)
                 (call-process "unzip" nil nil nil "-o" zip-file "-d" lsp-booster-install-dir)
                 (let ((binary (expand-file-name "emacs-lsp-booster" lsp-booster-install-dir)))
                   (set-file-modes binary #o755)
                   (delete-file zip-file)
                   (message "emacs-lsp-booster installed to %s" binary))))))
         nil t))))

  (lsp-booster--ensure-installed)
#+END_SRC

**** Advice functions

#+BEGIN_SRC emacs-lisp
  (defun lsp-booster--advice-json-parse (old-fn &rest args)
    "Try to parse bytecode instead of json."
    (or
     (when (equal (following-char) ?#)
       (let ((bytecode (read (current-buffer))))
         (when (byte-code-function-p bytecode)
           (funcall bytecode))))
     (apply old-fn args)))
  (advice-add (if (progn (require 'json)
                         (fboundp 'json-parse-buffer))
                  'json-parse-buffer
                'json-read)
              :around
              #'lsp-booster--advice-json-parse)

  (defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
    "Prepend emacs-lsp-booster command to lsp CMD."
    (let ((orig-result (funcall old-fn cmd test?)))
      (if (and (not test?)
               (not (file-remote-p default-directory))
               (not (functionp 'json-rpc-connection))
               (executable-find "emacs-lsp-booster"))
          (progn
            (message "Using emacs-lsp-booster for %s!" orig-result)
            (cons "emacs-lsp-booster" orig-result))
        orig-result)))
  (advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)
#+END_SRC

** Java Development (LSP Java)

Java language support using Eclipse JDT Language Server. The server will be
downloaded and installed automatically on first use.

