init.org
*** Auto-detecting installed JDKs

Previously =lsp-java-configuration-runtimes= listed JDK paths by hand, which
produced warnings such as /Invalid runtime for JavaSE-1.8: The path points to a
missing or inaccessible folder/ whenever the machine did not ship that exact
version. The helpers below scan the usual JVM install roots and build the
runtime vector dynamically:

- =/usr/lib/jvm= -- Debian, Ubuntu, Fedora
- =/usr/java= -- Oracle RPM installs
- =/Library/Java/JavaVirtualMachines= -- macOS (with =Contents/Home= handled)

Each directory name matching =java-N=, =jdk-N=, or =openjdk-N= (optionally
prefixed with =1.= for the legacy Java 8 layout) is turned into a
=JavaSE-<version>= entry. The newest detected version is marked as the default
runtime, and the same JDK is used as =lsp-java-java-path= to launch the JDT
server itself. Symlinks like Debian's =default-java= are skipped so that each
version appears only once.

#+BEGIN_SRC emacs-lisp
(use-package lsp-java
  :straight t
  :after lsp-mode
  :preface
  (defun my/detect-java-runtimes ()
    "Return a vector for `lsp-java-configuration-runtimes' by scanning
common JVM install roots.  Each detected JDK becomes a JavaSE-<version>
entry; the newest version is marked as default."
    (let* ((roots '("/usr/lib/jvm"
                    "/usr/java"
                    "/Library/Java/JavaVirtualMachines"))
           (re "\\`\\(?:java-\\|jdk-?\\|openjdk-\\)\\(?:1\\.\\)?\\([0-9]+\\)")
           (best (make-hash-table :test 'eql)))
      (dolist (root roots)
        (when (file-directory-p root)
          (dolist (entry (directory-files root t "\\`[^.]"))
            (let ((base (file-name-nondirectory entry)))
              (when (and (file-directory-p entry)
                         (not (file-symlink-p entry))
                         (string-match re base))
                (let* ((ver (string-to-number (match-string 1 base)))
                       (mac-home (expand-file-name "Contents/Home" entry))
                       (home (if (file-directory-p mac-home) mac-home entry))
                       (java-bin (expand-file-name "bin/java" home))
                       (existing (gethash ver best)))
                  (when (and (file-executable-p java-bin)
                             (or (null existing)
                                 (< (length home) (length existing))))
                    (puthash ver home best))))))))
      (let* ((versions (sort (hash-table-keys best) #'<))
             (newest (car (last versions))))
        (apply #'vector
               (mapcar (lambda (v)
                         (let ((name (format "JavaSE-%s" (if (= v 8) "1.8" v)))
                               (path (gethash v best)))
                           (if (= v newest)
                               (list :name name :path path :default t)
                             (list :name name :path path))))
                       versions)))))

  (defun my/detect-java-path ()
    "Path of the newest `java' executable detected by
`my/detect-java-runtimes', or nil when no JDK is found."
    (let ((default (seq-find (lambda (r) (plist-get r :default))
                             (append (my/detect-java-runtimes) nil))))
      (when default
        (expand-file-name "bin/java" (plist-get default :path)))))
  :config
  (setq lsp-java-server-install-dir "~/.emacs.d/lsp-java/"
        lsp-java-workspace-dir (expand-file-name "~/.emacs.d/lsp-java-workspace/")
        lsp-java-import-gradle-enabled t
        lsp-java-import-maven-enabled t
        lsp-java-maven-download-sources t
        lsp-java-autobuild-enabled t
        lsp-java-format-enabled t
        lsp-java-format-settings-url nil
        lsp-java-format-settings-profile nil
        lsp-java-code-generation-use-blocks t)
  (let ((runtimes (my/detect-java-runtimes))
        (java-path (my/detect-java-path)))
    (when (> (length runtimes) 0)
      (setq lsp-java-configuration-runtimes runtimes))
    (when java-path
      (setq lsp-java-java-path java-path)))
  :hook
  (java-mode . (lambda ()
                 (require 'lsp-java)
                 (lsp-deferred))))
#+END_SRC

Machine-specific overrides (for example adding a runtime installed in a
non-standard location) belong in =local-init.el=; just =setq= the two variables
after this block has run.

** COMMENT Kill buffer instead of burying it

#+begin_src emacs-lisp 
(defadvice quit-window (before quit-window-always-kill)
  "When running `quit-window', always kill the buffer."
  (ad-set-arg 0 t))
(ad-activate 'quit-window)
#+end_src
** Default column width 80 characters
#+begin_src emacs-lisp 
(setq default-fill-column 80)
#+end_src

** Don't confirm kills

#+BEGIN_SRC emacs-lisp

  (global-set-key (kbd "C-x k")
                (lambda () (interactive) (kill-this-buffer)))
#+END_SRC

** Protocol Buffers  mode

[[https://developers.google.com/protocol-buffers/docs/overview][Google Protocol Buffers]] is way to serialize data. It uses "proto" files to describe serialization format.

#+begin_src emacs-lisp 
(require 'protobuf-mode)
(add-to-list 'auto-mode-alist '("\\.proto\\'" . protobuf-mode))
#+end_src

** Open current buffer in idea
#+begin_src emacs-lisp 
  (defun open-buffer-curent-idea ()
    ""
    (interactive)
    (call-process "idea" nil nil nil (buffer-file-name))
    (if (string-equal system-type "darwin")
        (ns-do-applescript "tell application \"IntelliJ Idea\" to activate")
      )
  )

  (global-set-key (kbd "C-q C-o")  'open-buffer-curent-idea)
#+end_src

** Toggle transparency of current frame

Sometime it is nice to look what is behind the frame. Following code toggles frame to be almost completely transparent
and back to solid again. 
#+begin_src emacs-lisp 
  (defun ps/toggle-transparency ()
    "Toggles frame transparency."
    (interactive)
    (if (equal '(100 100) (frame-parameter (selected-frame) 'alpha))
        (set-frame-parameter (selected-frame) 'alpha '(10 10))
      (set-frame-parameter (selected-frame) 'alpha '(100 100))))

  (global-set-key (kbd "C-q t")  'ps/toggle-transparency)
#+end_src

** PlantUML support

PlantUML works using JAR. Next is function that will load the jar if it is missing. Function returns the path where the
jar was loaded.

#+begin_src emacs-lisp 
  (defun pw/download-plantuml-jar-if-needed () ""
         (let ((plantuml-jar "~/.emacs.d/plantuml.jar"))
           (if (not (file-exists-p plantuml-jar))
               (progn
                 (url-copy-file "http://downloads.sourceforge.net/project/plantuml/plantuml.jar?r=http%3A%2F%2Fplantuml.com%2Fdownload.html&ts=1441279540&use_mirror=netix" plantuml-jar)
                 ))
           (expand-file-name plantuml-jar)))
#+end_src

#+begin_src emacs-lisp
  (use-package deflate
    :straight (deflate :type git :host github :repo "skuro/deflate"))

    (use-package plantuml-mode
      :straight (plantuml-mode :type git :host github :repo "skuro/plantuml-mode")
      :mode ("\\.plantuml\\'" "\\.puml\\'")
      :config
      (setq plantuml-default-exec-mode 'jar
            org-plantuml-jar-path (pw/download-plantuml-jar-if-needed)
            plantuml-jar-path (pw/download-plantuml-jar-if-needed)))
#+end_src

Now we can set the PlantUML jar for org-mode.
#+begin_src emacs-lisp 
;; Don`t confirm plant uml runs for conviency.
(let ((default-confirm org-confirm-babel-evaluate))
  (defun my-org-confirm-babel-evaluate (lang body)
    (if (string= lang "plantuml") nil default-confirm))
  (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
  )

(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
(setq org-startup-with-inline-images t)
(setq plantuml-indent-level 2)
(setq org-src-tab-acts-natively t)
(setq org-edit-src-content-indentation 0)
#+end_src
** AI tool setup

This section configures AI tools (gptel, ellama, aidermacs, Claude Code) for use with
different LLM backends. The configuration is designed to be machine-independent by using
variables that can be overridden in =local-pre-init.el=.

*** Machine-Dependent Configuration

The following variables control which LLM backend is used and should be set in
=~/.emacs.d/local-pre-init.el= before this configuration loads:

**** Work Machine Example (Bedrock + Ollama)
#+BEGIN_EXAMPLE emacs-lisp
;; In local-pre-init.el for work machine:
;; Use AWS Bedrock for main chat, Ollama for autocomplete

;; Ollama configuration (for autocomplete)
(defvar my/ollama-host-name "127.0.0.1")
(defvar my/ollama-port 11434)
(defvar my/ollama-chat-model "gpt-oss:20b")
(defvar my/ollama-fast-model "llama3.1:8b")
(defvar my/ollama-utility-model "qwen2.5-coder:14b")
(defvar my/ollama-embedding-model "nomic-embed-text")

;; Use Bedrock for gptel
(defvar my/use-bedrock-gptel t)
(defvar my/bedrock-region "eu-west-1")
(defvar my/bedrock-model-region 'eu)
(defvar my/bedrock-model 'claude-opus-4-6)

;; Use Ollama for autocomplete
(defvar my/use-ollama-autocomplete t)
#+END_EXAMPLE

**** Personal Machine Example (Claude API + Ollama)
#+BEGIN_EXAMPLE emacs-lisp
;; In local-pre-init.el for personal machine:
;; Use Claude API directly, Ollama for autocomplete

;; Ollama configuration (for autocomplete and ellama)
(defvar my/ollama-host-name "127.0.0.1")
(defvar my/ollama-port 11434)
(defvar my/ollama-chat-model "gpt-oss:20b")
(defvar my/ollama-fast-model "llama3.1:8b")
(defvar my/ollama-utility-model "qwen2.5-coder:14b")
(defvar my/ollama-embedding-model "nomic-embed-text")

;; Use Claude API for gptel
(defvar my/use-bedrock-gptel nil)
(defvar my/claude-api-key "your-api-key-here")  ; Or use auth-source
(defvar my/claude-model 'claude-sonnet-4-20250514)

;; Use Ollama for autocomplete
(defvar my/use-ollama-autocomplete t)
#+END_EXAMPLE

