init.el

(use-package lsp-java
  :straight t
  :after lsp-mode
  :preface
  (defun my/detect-java-runtimes ()
    "Return a vector for `lsp-java-configuration-runtimes' by scanning
common JVM install roots.  Each detected JDK becomes a JavaSE-<version>
entry; the newest version is marked as default."
    (let* ((roots '("/usr/lib/jvm"
                    "/usr/java"
                    "/Library/Java/JavaVirtualMachines"))
           (re "\\`\\(?:java-\\|jdk-?\\|openjdk-\\)\\(?:1\\.\\)?\\([0-9]+\\)")
           (best (make-hash-table :test 'eql)))
      (dolist (root roots)
        (when (file-directory-p root)
          (dolist (entry (directory-files root t "\\`[^.]"))
            (let ((base (file-name-nondirectory entry)))
              (when (and (file-directory-p entry)
                         (not (file-symlink-p entry))
                         (string-match re base))
                (let* ((ver (string-to-number (match-string 1 base)))
                       (mac-home (expand-file-name "Contents/Home" entry))
                       (home (if (file-directory-p mac-home) mac-home entry))
                       (java-bin (expand-file-name "bin/java" home))
                       (existing (gethash ver best)))
                  (when (and (file-executable-p java-bin)
                             (or (null existing)
                                 (< (length home) (length existing))))
                    (puthash ver home best))))))))
      (let* ((versions (sort (hash-table-keys best) #'<))
             (newest (car (last versions))))
        (apply #'vector
               (mapcar (lambda (v)
                         (let ((name (format "JavaSE-%s" (if (= v 8) "1.8" v)))
                               (path (gethash v best)))
                           (if (= v newest)
                               (list :name name :path path :default t)
                             (list :name name :path path))))
                       versions)))))

  (defun my/detect-java-path ()
    "Path of the newest `java' executable detected by
`my/detect-java-runtimes', or nil when no JDK is found."
    (let ((default (seq-find (lambda (r) (plist-get r :default))
                             (append (my/detect-java-runtimes) nil))))
      (when default
        (expand-file-name "bin/java" (plist-get default :path)))))
  :config
  (setq lsp-java-server-install-dir "~/.emacs.d/lsp-java/"
        lsp-java-workspace-dir (expand-file-name "~/.emacs.d/lsp-java-workspace/")
        lsp-java-import-gradle-enabled t
        lsp-java-import-maven-enabled t
        lsp-java-maven-download-sources t
        lsp-java-autobuild-enabled t
        lsp-java-format-enabled t
        lsp-java-format-settings-url nil
        lsp-java-format-settings-profile nil
        lsp-java-code-generation-use-blocks t)
  (let ((runtimes (my/detect-java-runtimes))
        (java-path (my/detect-java-path)))
    (when (> (length runtimes) 0)
      (setq lsp-java-configuration-runtimes runtimes))
    (when java-path
      (setq lsp-java-java-path java-path)))
  :hook
  (java-mode . (lambda ()
                 (require 'lsp-java)
                 (lsp-deferred))))

(setq default-fill-column 80)

(global-set-key (kbd "C-x k")
              (lambda () (interactive) (kill-this-buffer)))

(require 'protobuf-mode)
(add-to-list 'auto-mode-alist '("\\.proto\\'" . protobuf-mode))

(defun open-buffer-curent-idea ()
  ""
  (interactive)
  (call-process "idea" nil nil nil (buffer-file-name))
  (if (string-equal system-type "darwin")
      (ns-do-applescript "tell application \"IntelliJ Idea\" to activate")
    )
)

(global-set-key (kbd "C-q C-o")  'open-buffer-curent-idea)

(defun ps/toggle-transparency ()
  "Toggles frame transparency."
  (interactive)
  (if (equal '(100 100) (frame-parameter (selected-frame) 'alpha))
      (set-frame-parameter (selected-frame) 'alpha '(10 10))
    (set-frame-parameter (selected-frame) 'alpha '(100 100))))

(global-set-key (kbd "C-q t")  'ps/toggle-transparency)

(defun pw/download-plantuml-jar-if-needed () ""
       (let ((plantuml-jar "~/.emacs.d/plantuml.jar"))
         (if (not (file-exists-p plantuml-jar))
             (progn
               (url-copy-file "http://downloads.sourceforge.net/project/plantuml/plantuml.jar?r=http%3A%2F%2Fplantuml.com%2Fdownload.html&ts=1441279540&use_mirror=netix" plantuml-jar)
               ))
         (expand-file-name plantuml-jar)))

(use-package deflate
  :straight (deflate :type git :host github :repo "skuro/deflate"))

  (use-package plantuml-mode
    :straight (plantuml-mode :type git :host github :repo "skuro/plantuml-mode")
    :mode ("\\.plantuml\\'" "\\.puml\\'")
    :config
    (setq plantuml-default-exec-mode 'jar
          org-plantuml-jar-path (pw/download-plantuml-jar-if-needed)
          plantuml-jar-path (pw/download-plantuml-jar-if-needed)))

;; Don`t confirm plant uml runs for conviency.
(let ((default-confirm org-confirm-babel-evaluate))
  (defun my-org-confirm-babel-evaluate (lang body)
    (if (string= lang "plantuml") nil default-confirm))
  (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
  )

(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
(setq org-startup-with-inline-images t)
(setq plantuml-indent-level 2)
(setq org-src-tab-acts-natively t)
(setq org-edit-src-content-indentation 0)
