init.org
*** Default Values (used if not set in local-pre-init.el)

#+begin_src emacs-lisp
;; Ollama host configuration
(unless (boundp 'my/ollama-host-name)
  (defvar my/ollama-host-name "127.0.0.1"))
(unless (boundp 'my/ollama-port)
  (defvar my/ollama-port 11434))

;; Ollama model names
(unless (boundp 'my/ollama-chat-model)
  (defvar my/ollama-chat-model "gpt-oss:20b"))
(unless (boundp 'my/ollama-fast-model)
  (defvar my/ollama-fast-model "llama3.1:8b"))
(unless (boundp 'my/ollama-utility-model)
  (defvar my/ollama-utility-model "qwen2.5-coder:14b"))
(unless (boundp 'my/ollama-embedding-model)
  (defvar my/ollama-embedding-model "nomic-embed-text"))

;; Derived variable
(defvar my/ollama-host
  (format "%s:%d" my/ollama-host-name my/ollama-port))

;; Backend selection defaults
(unless (boundp 'my/use-bedrock-gptel)
  (defvar my/use-bedrock-gptel t))  ; Default to Bedrock
(unless (boundp 'my/use-ollama-autocomplete)
  (defvar my/use-ollama-autocomplete t))

;; Bedrock configuration defaults
(unless (boundp 'my/bedrock-region)
  (defvar my/bedrock-region "us-east-1"))
(unless (boundp 'my/bedrock-model-region)
  (defvar my/bedrock-model-region 'us))
(unless (boundp 'my/bedrock-model)
  (defvar my/bedrock-model 'claude-sonnet-4-20250514))

;; Claude API configuration defaults
(unless (boundp 'my/claude-api-key)
  (defvar my/claude-api-key nil))  ; Should be set in local-pre-init.el
(unless (boundp 'my/claude-model)
  (defvar my/claude-model 'claude-sonnet-4-20250514))
#+end_src

*** AI keymap
#+begin_src emacs-lisp
(define-prefix-command 'my/ai-map)
(global-set-key (kbd "C-q a") #'my/ai-map)
#+end_src

*** gptel

Configure gptel to use either Bedrock or Claude API based on machine configuration.

#+begin_src emacs-lisp
(use-package gptel
  :straight t
  :straight t
  :commands (gptel gptel-send gptel-rewrite)
  :init
  ;; Always set up Ollama backend (might be used for autocomplete)
  (setq my/gptel-ollama
        (gptel-make-ollama
         "Ollama"
         :host my/ollama-host
         :stream t
         :models (mapcar #'intern
                        (list my/ollama-chat-model
                              my/ollama-fast-model
                              my/ollama-utility-model))))

  ;; Set up the main backend based on configuration
  (if my/use-bedrock-gptel
      ;; Use AWS Bedrock
      (progn
        (setq my/gptel-main-backend
              (gptel-make-bedrock
               "Claude-Bedrock"
               :stream t
               :region 'eu-west-1'
               :model-region 'eu
               :models '(claude-opus-4-6
                 claude-sonnet-4-20250514
                 claude-haiku-4-5-20251001)))               

        (setq my/gptel-main-model my/bedrock-model))
    ;; Use Claude API directly
    (progn
      (setq my/gptel-main-backend
            (gptel-make-anthropic
             "Claude"
             :stream t
             :key my/claude-api-key))  ; Can also use 'gptel-api-key for auth-source
      (setq my/gptel-main-model my/claude-model)))

  :config
  (setq gptel-backend my/gptel-main-backend)
  (setq gptel-model my/gptel-main-model)
  (setq gptel-default-mode 'org-mode)
  (setq gptel-track-response nil)

  (define-key my/ai-map (kbd "c") #'gptel)
  (define-key my/ai-map (kbd "s") #'gptel-send)
  (define-key my/ai-map (kbd "r") #'gptel-rewrite))
#+end_src

*** aidermacs

Aider configuration uses environment variables =AIDER_MODEL= and =AIDER_WEAK_MODEL=.
These should be set in your shell profile or in =local-pre-init.el= using:

#+BEGIN_EXAMPLE emacs-lisp
;; In local-pre-init.el (optional, if not set in shell):
(setenv "AIDER_MODEL" "bedrock/anthropic.claude-sonnet-4-20250514-v1:0")
(setenv "AIDER_WEAK_MODEL" "bedrock/anthropic.claude-3-5-haiku-20241022-v1:0")
;; or for personal machine:
(setenv "AIDER_MODEL" "claude-sonnet-4-20250514")
(setenv "AIDER_WEAK_MODEL" "claude-3-5-haiku-20241022")
#+END_EXAMPLE

#+begin_src emacs-lisp
(use-package aidermacs
  :straight t
  :commands (aidermacs-transient-menu aidermacs-run-aider)
  :init
  (setq aidermacs-default-chat-mode 'architect)
  (setq aidermacs-use-voice nil)
  :config
  (setq aidermacs-default-model (exec-path-from-shell-getenv "AIDER_MODEL"))
  (setq aidermacs-weak-model (exec-path-from-shell-getenv "AIDER_WEAK_MODEL"))
  (define-key my/ai-map (kbd "a") #'aidermacs-transient-menu))
#+end_src

*** aidermacs / git helper
#+begin_src emacs-lisp
(defun my/git-diff-staged-to-buffer ()
  "Show staged git diff in a temp buffer."
  (interactive)
  (let ((buf (get-buffer-create "*git-staged-diff*")))
    (with-current-buffer buf
      (erase-buffer)
      (call-process "git" nil buf nil "diff" "--staged")
      (diff-mode))
    (pop-to-buffer buf)))

(define-key my/ai-map (kbd "d") #'my/git-diff-staged-to-buffer)
#+end_src

*** ellama
#+begin_src emacs-lisp
(use-package llm
  :straight t
  :straight t)

(use-package ellama
  :straight t
  :straight t
  :after llm
  :config
  (require 'llm-ollama)

  (setq ellama-provider
        (make-llm-ollama
         :host my/ollama-host-name
         :port my/ollama-port
         :chat-model my/ollama-utility-model
         :embedding-model my/ollama-embedding-model))


  (setq ellama-language "English")
  (setq ellama-naming-provider ellama-provider)
  (setq ellama-summarization-provider ellama-provider)

  (define-key my/ai-map (kbd "e") #'ellama)
  (define-key my/ai-map (kbd "i") #'ellama-improve-wording)
  (define-key my/ai-map (kbd "m") #'ellama-summarize))
#+end_src

*** gptel autocomplete

Autocomplete can use either Ollama (faster, local) or the main backend.
Set =my/use-ollama-autocomplete= in =local-pre-init.el= to control this.

#+begin_src emacs-lisp
;; Set up autocomplete backend based on configuration
(when my/use-ollama-autocomplete
  (setq my/gptel-autocompletion-backend
        (gptel-make-ollama
         "autocomplete"
         :host my/ollama-host
         :models (list my/ollama-utility-model))))

;; If not using Ollama, use the main backend
(unless (boundp 'my/gptel-autocompletion-backend)
  (setq my/gptel-autocompletion-backend my/gptel-main-backend))

(use-package gptel-autocomplete
  :straight '(:type git :host github :repo "JDNdeveloper/gptel-autocomplete")
  :config
  (require 'gptel-autocomplete)
  (setq gptel-autocomplete-before-context-lines 100
        gptel-autocomplete-after-context-lines 20
        gptel-autocomplete-temperature 0.1
        gptel-autocomplete-use-context t
        gptel-autocomplete-idle-delay 0)
  (keymap-set gptel-autocomplete-completion-map "C-e" #'gptel-accept-completion)
  (keymap-set gptel-autocomplete-completion-map "<tab>" #'gptel-accept-completion)
  (keymap-set gptel-autocomplete-completion-map "M-f" #'gptel-accept-word)
  (define-key my/ai-map (kbd "<tab>") #'gptel-autocomplete-mode)

  (defun my/gptel-autocomplete-backend (orig &rest args)
    (let ((gptel-backend my/gptel-autocompletion-backend))
      (apply orig args)))
  (advice-add 'gptel-complete :around #'my/gptel-autocomplete-backend))
#+end_src

*** Claude code support

Claude Code can use either Bedrock or Claude API. Set these environment variables
in your shell profile or in =local-pre-init.el=:

**** For Bedrock (work machine):
#+BEGIN_EXAMPLE emacs-lisp
;; In local-pre-init.el:
(setenv "CLAUDE_CODE_USE_BEDROCK" "1")
(setenv "AWS_BEARER_TOKEN_BEDROCK" "your-token")  ; If using bearer token auth
;; Or rely on AWS CLI credentials
#+END_EXAMPLE

**** For Claude API (personal machine):
#+BEGIN_EXAMPLE emacs-lisp
;; In local-pre-init.el:
(setenv "ANTHROPIC_API_KEY" "your-api-key")
;; Leave CLAUDE_CODE_USE_BEDROCK unset or set to ""
#+END_EXAMPLE

**** Vterm terminal emulator

#+begin_src emacs-lisp
(use-package vterm
  :straight t
  :commands (vterm vterm-other-window)
  :init
  ;; Optional: pick a convenient key
  (global-set-key (kbd "C-c t") #'vterm)
  :hook
  ;; Claude Code draws spinners and progress indicators whose width
  ;; fluctuates. Without this Emacs visually wraps long lines onto the
  ;; next row and the TUI jitters constantly.
  (vterm-mode . (lambda () (setq-local truncate-lines t))))
#+end_src

