init.org
**** Claude Code IDE integration

The =claude-code-ide= package connects Emacs to the Claude Code CLI
via MCP over WebSocket. It provides an ediff-based diff view,
diagnostics forwarding, and Emacs-side tools (xref, imenu, etc.)
that Claude can call.

Focus stays on the ediff buffer when a diff opens so that hunk
navigation (=n= / =p=) works immediately. Use =C-c C-c= to accept
all changes and quit without confirmation prompts, or =C-c C-k= to
cancel and revert the file to its saved state. Both bindings are set
via =ediff-keymap-setup-hook=, which runs after =ediff-set-keys=
creates the keymap (the map is =nil= until then, so earlier hooks
and =with-eval-after-load= do not work).

When Claude edits a file that is already open in Emacs, the diff
handler would normally trigger a "revert buffer?" prompt in the
minibuffer, hiding the diff. A =:before= advice on the diff-buffer
creation function silently reverts the stale buffer so the prompt
never appears. The advice is wrapped in =condition-case= so any
revert failure does not prevent the diff from opening.

#+begin_src emacs-lisp
(use-package claude-code-ide
  :straight (:type git :host github :repo "manzaltu/claude-code-ide.el")
  :bind ("C-q a t" . claude-code-ide-menu)
  :config
  ;; Copy environment variables from shell
  (exec-path-from-shell-copy-env "AWS_BEARER_TOKEN_BEDROCK")
  (exec-path-from-shell-copy-env "CLAUDE_CODE_USE_BEDROCK")
  (exec-path-from-shell-copy-env "ANTHROPIC_API_KEY")
  (setq claude-code-ide-terminal-backend 'vterm)
  (setq claude-code-ide-focus-claude-after-ediff nil)
  (claude-code-ide-emacs-tools-setup)
  ;; Silently revert an already-open buffer before diffing so that
  ;; find-file-noselect does not prompt "revert buffer?" in the
  ;; minibuffer and block the diff view.
  (define-advice claude-code-ide-mcp--create-diff-buffers
      (:before (old-file-path &rest _) auto-revert)
    "Silently revert buffer visiting OLD-FILE-PATH before diffing."
    (condition-case nil
        (when-let ((buf (find-buffer-visiting old-file-path)))
          (with-current-buffer buf
            (revert-buffer t t)))
      (error nil)))
  ;; Accept or cancel ediff without confirmation prompts.
  (add-hook 'ediff-keymap-setup-hook
    (lambda ()
      (define-key ediff-mode-map (kbd "C-c C-c")
        (lambda ()
          (interactive)
          (cl-letf (((symbol-function 'y-or-n-p) (lambda (&rest _) t))
                    ((symbol-function 'yes-or-no-p) (lambda (&rest _) t)))
            (ediff-quit nil))))
      (define-key ediff-mode-map (kbd "C-c C-k")
        (lambda ()
          (interactive)
          (let ((buf ediff-buffer-A))
            (cl-letf (((symbol-function 'y-or-n-p) (lambda (&rest _) t))
                      ((symbol-function 'yes-or-no-p) (lambda (&rest _) t)))
              (ediff-quit nil))
            (when (buffer-live-p buf)
              (with-current-buffer buf
                (revert-buffer t t)))))))))
#+end_src



** Grab environment variables from shell

#+BEGIN_SRC emacs-lisp
(straight-use-package 'exec-path-from-shell)
(require 'exec-path-from-shell)
(exec-path-from-shell-copy-env "AWS_REGION")
(exec-path-from-shell-copy-env "AWS_PROFILE")
#+END_SRC

** Run local init

Finally, after all the other initializations, run local initialization file.
This file (=~/.emacs.d/local-init.el=) should contain:

- Machine-specific package configurations that depend on packages loaded in =init.org=
- Custom functions or keybindings specific to this machine
- Overrides of default settings from =init.org=

*Note:* Use =local-pre-init.el= for configuration that must be set *before* packages
are loaded (like AI backend selection, proxy settings, environment variables).
Use =local-init.el= for configuration that must run *after* packages are loaded.

#+BEGIN_SRC emacs-lisp
  (setq local-init-file "~/.emacs.d/local-init.el")
  (if (file-exists-p local-init-file)
  (load local-init-file)
  )
#+END_SRC

** COMMENT Markdown mode

#+BEGIN_SRC emacs-lisp 
(el-get-install 'markdown-mode)
#+END_SRC
